#!/usr/bin/env python
# -*- coding: utf-8 -*-
#
#  test_qutrub.py
#  
#  Copyright 2019 zerrouki <zerrouki@majd4>
#  
#  This program is free software; you can redistribute it and/or modify
#  it under the terms of the GNU General Public License as published by
#  the Free Software Foundation; either version 2 of the License, or
#  (at your option) any later version.
#  
#  This program is distributed in the hope that it will be useful,
#  but WITHOUT ANY WARRANTY; without even the implied warranty of
#  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
#  GNU General Public License for more details.
#  
#  You should have received a copy of the GNU General Public License
#  along with this program; if not, write to the Free Software
#  Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston,
#  MA 02110-1301, USA.
#  
#  

from __future__ import (
    absolute_import,
    print_function,
    unicode_literals,
    division,
    )
import unittest
import sys
sys.path.append('../libqutrub')
import libqutrub.conjugator

class QurtubTestCase(unittest.TestCase):
    """Tests for `libqutrub`."""

    def test_conjugate(self):
        """Test conjugation"""
        verb=u"سعد"
        future_type =u"كسرة"
        all = True # all tenses
        past = True
        future=True
        passive =True
        imperative=True
        future_moode= True
        confirmed=False
        transitive =True
        display_format="DICT"
        table_target = {'المضارع المنصوب': {'أنتم': 'تَسْعِدُوا', 'هما': 'يَسْعِدَا', 'نحن': 'نَسْعِدَ', 'هم': 'يَسْعِدُوا', 'أنتِ': 'تَسْعِدِي', 'هو': 'يَسْعِدَ', 'هن': 'يَسْعِدْنَ', 'أنتما مؤ': 'تَسْعِدَا', 'هما مؤ': 'تَسْعِدَا', 'أنتن': 'تَسْعِدْنَ', 'هي': 'تَسْعِدَ', 'أنت': 'تَسْعِدَ', 'أنا': 'أَسْعِدَ', 'أنتما': 'تَسْعِدَا'}, 'الماضي المجهول': {'أنتم': 'سُعِدْتُم', 'هما': 'سُعِدَا', 'نحن': 'سُعِدْنَا', 'هم': 'سُعِدُوا', 'أنتِ': 'سُعِدْتِ', 'هو': 'سُعِدَ', 'هن': 'سُعِدْنَ', 'أنتما مؤ': 'سُعِدْتُمَا', 'هما مؤ': 'سُعِدَتَا', 'أنتن': 'سُعِدْتُنَّ', 'هي': 'سُعِدَتْ', 'أنت': 'سُعِدْتَ', 'أنا': 'سُعِدْتُ', 'أنتما': 'سُعِدْتُمَا'}, 'المضارع المجهول': {'أنتم': 'تُسْعَدُونَ', 'هما': 'يُسْعَدَانِ', 'نحن': 'نُسْعَدُ', 'هم': 'يُسْعَدُونَ', 'أنتِ': 'تُسْعَدِينَ', 'هو': 'يُسْعَدُ', 'هن': 'يُسْعَدْنَ', 'أنتما مؤ': 'تُسْعَدَانِ', 'هما مؤ': 'تُسْعَدَانِ', 'أنتن': 'تُسْعَدْنَ', 'هي': 'تُسْعَدُ', 'أنت': 'تُسْعَدُ', 'أنا': 'أُسْعَدُ', 'أنتما': 'تُسْعَدَانِ'}, 'المضارع المعلوم': {'أنتم': 'تَسْعِدُونَ', 'هما': 'يَسْعِدَانِ', 'نحن': 'نَسْعِدُ', 'هم': 'يَسْعِدُونَ', 'أنتِ': 'تَسْعِدِينَ', 'هو': 'يَسْعِدُ', 'هن': 'يَسْعِدْنَ', 'أنتما مؤ': 'تَسْعِدَانِ', 'هما مؤ': 'تَسْعِدَانِ', 'أنتن': 'تَسْعِدْنَ', 'هي': 'تَسْعِدُ', 'أنت': 'تَسْعِدُ', 'أنا': 'أَسْعِدُ', 'أنتما': 'تَسْعِدَانِ'}, 'الأمر': {'أنتم': 'اِسْعِدُوا', 'هما': '', 'نحن': '', 'هم': '', 'أنتِ': 'اِسْعِدِي', 'هو': '', 'هن': '', 'أنتما مؤ': 'اِسْعِدَا', 'هما مؤ': '', 'أنتن': 'اِسْعِدْنَ', 'هي': '', 'أنت': 'اِسْعِدْ', 'أنا': '', 'أنتما': 'اِسْعِدَا'}, 'المضارع المجزوم': {'أنتم': 'تَسْعِدُوا', 'هما': 'يَسْعِدَا', 'نحن': 'نَسْعِدْ', 'هم': 'يَسْعِدُوا', 'أنتِ': 'تَسْعِدِي', 'هو': 'يَسْعِدْ', 'هن': 'يَسْعِدْنَ', 'أنتما مؤ': 'تَسْعِدَا', 'هما مؤ': 'تَسْعِدَا', 'أنتن': 'تَسْعِدْنَ', 'هي': 'تَسْعِدْ', 'أنت': 'تَسْعِدْ', 'أنا': 'أَسْعِدْ', 'أنتما': 'تَسْعِدَا'}, 'المضارع المؤكد الثقيل المجهول ': {'هي': 'تُسْعَدَنَّ', 'أنتم': 'تُسْعَدُنَّ', 'هما': 'يُسْعَدَانِّ', 'نحن': 'نُسْعَدَنَّ', 'هم': 'يُسْعَدُنَّ', 'أنتِ': 'تُسْعَدِنَّ', 'هن': 'يُسْعَدْنَانِّ', 'هما مؤ': 'تُسْعَدَانِّ', 'أنتما مؤ': 'تُسْعَدَانِّ', 'أنتن': 'تُسْعَدْنَانِّ', 'هو': 'يُسْعَدَنَّ', 'أنت': 'تُسْعَدَنَّ', 'أنا': 'أُسْعَدَنَّ', 'أنتما': 'تُسْعَدَانِّ'}, 'المضارع المؤكد الثقيل': {'أنتم': 'تَسْعِدُنَّ', 'هما': 'يَسْعِدَانِّ', 'نحن': 'نَسْعِدَنَّ', 'هم': 'يَسْعِدُنَّ', 'أنتِ': 'تَسْعِدِنَّ', 'هو': 'يَسْعِدَنَّ', 'هن': 'يَسْعِدْنَانِّ', 'أنتما مؤ': 'تَسْعِدَانِّ', 'هما مؤ': 'تَسْعِدَانِّ', 'أنتن': 'تَسْعِدْنَانِّ', 'هي': 'تَسْعِدَنَّ', 'أنت': 'تَسْعِدَنَّ', 'أنا': 'أَسْعِدَنَّ', 'أنتما': 'تَسْعِدَانِّ'}, 'المضارع المجهول المنصوب': {'أنتم': 'تُسْعَدُوا', 'هما': 'يُسْعَدَا', 'نحن': 'نُسْعَدَ', 'هم': 'يُسْعَدُوا', 'أنتِ': 'تُسْعَدِي', 'هو': 'يُسْعَدَ', 'هن': 'يُسْعَدْنَ', 'أنتما مؤ': 'تُسْعَدَا', 'هما مؤ': 'تُسْعَدَا', 'أنتن': 'تُسْعَدْنَ', 'هي': 'تُسْعَدَ', 'أنت': 'تُسْعَدَ', 'أنا': 'أُسْعَدَ', 'أنتما': 'تُسْعَدَا'}, 'الماضي المعلوم': {'أنتم': 'سَعَدْتُم', 'هما': 'سَعَدَا', 'نحن': 'سَعَدْنَا', 'هم': 'سَعَدُوا', 'أنتِ': 'سَعَدْتِ', 'هو': 'سَعَدَ', 'هن': 'سَعَدْنَ', 'أنتما مؤ': 'سَعَدْتُمَا', 'هما مؤ': 'سَعَدَتَا', 'أنتن': 'سَعَدْتُنَّ', 'هي': 'سَعَدَتْ', 'أنت': 'سَعَدْتَ', 'أنا': 'سَعَدْتُ', 'أنتما': 'سَعَدْتُمَا'}, 'الأمر المؤكد': {'أنتم': 'اِسْعِدُنَّ', 'هما': '', 'نحن': '', 'هم': '', 'أنتِ': 'اِسْعِدِنَّ', 'هو': '', 'هن': '', 'أنتما مؤ': 'اِسْعِدَانِّ', 'هما مؤ': '', 'أنتن': 'اِسْعِدْنَانِّ', 'هي': '', 'أنت': 'اِسْعِدَنَّ', 'أنا': '', 'أنتما': 'اِسْعِدَانِّ'}, 'المضارع المجهول المجزوم': {'أنتم': 'تُسْعَدُوا', 'هما': 'يُسْعَدَا', 'نحن': 'نُسْعَدْ', 'هم': 'يُسْعَدُوا', 'أنتِ': 'تُسْعَدِي', 'هو': 'يُسْعَدْ', 'هن': 'يُسْعَدْنَ', 'أنتما مؤ': 'تُسْعَدَا', 'هما مؤ': 'تُسْعَدَا', 'أنتن': 'تُسْعَدْنَ', 'هي': 'تُسْعَدْ', 'أنت': 'تُسْعَدْ', 'أنا': 'أُسْعَدْ', 'أنتما': 'تُسْعَدَا'}}

        table = libqutrub.conjugator.conjugate(verb,future_type,all,past,future,passive,imperative,future_moode,confirmed,transitive,display_format);
        #~ print(table)
        self.assertEqual(table_target, table)



if __name__ == '__main__':
    unittest.main()
